app/controllers/articles_controller.rb

INSERT INTO "articles" ("tittle", "body", "created_at", "updated_at", "status", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    if cannot? :create, Article
      redirect_to article_path, alert: "You are not authorized to create Article"
    end
    @article = current_user.articles.new(article_params)
    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "articles" SET "tittle" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["tittle", "AI maths assistant could help solve problems that humans are stuck on Edited"], ["updated_at", "2024-11-19 10:58:12.835354"], ["id", 14]]
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)